/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   arraypointers.c                                    :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: kcharlet <marvin@42.fr>                    +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2019/10/15 19:16:22 by kcharlet          #+#    #+#             */
/*   Updated: 2019/10/15 19:16:25 by kcharlet         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

int     main()
{
    int *ptr;
    int array[10];
    int res1;
    int res2;

    ptr = array;
    res1 = ptr[5] = 100; /* в присваении используется индекс */
    res2 = *(ptr + 5) = 100; /* в присвоении используется адресная арифметика */
    ft_putnbr(res1);
    ft_putchar('\n');
    ft_putnbr(res2);
    return (0);
}

/* В результате получили одинаковый результат */