/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   array_pointer.c                                    :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: kcharlet <marvin@42.fr>                    +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2019/10/17 15:22:54 by kcharlet          #+#    #+#             */
/*   Updated: 2019/10/17 15:22:58 by kcharlet         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

int     main()
{
   char arr[80] = "Hello";
   char *ptr;

   ptr = arr; // Здесь ptr указывает на первый элемент массива arr.
   ft_putchar(arr[4]); // Обратиться к пятому элементу массива str можно с помощью любого из двух выражений
   ft_putchar('\n');
   ft_putchar(*(ptr + 4)); // Обратиться к пятому элементу массива str можно с помощью любого из двух выражений
   ft_putchar(*arr); // имя массива без индекса возвращает адрес первого элемента массива
   return (0);
}
