/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ifelse.c                                           :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: kcharlet <marvin@42.fr>                    +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2019/10/09 18:16:24 by kcharlet          #+#    #+#             */
/*   Updated: 2019/10/09 18:16:43 by kcharlet         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include <stdio.h>
#include <stdlib.h>

int main(void)
{
  int magic; /* магическое число */
  int guess; /* попытка игрока */

  magic = rand(); /* генерация магического числа */

  printf("Угадай магическое число: ");
  scanf("%d", &guess);

  if(guess == magic) printf("** Верно **");
  else printf("Неверно");

  return 0;
}