/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   onemorpointer.c                                    :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: kcharlet <marvin@42.fr>                    +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2019/10/18 18:44:39 by kcharlet          #+#    #+#             */
/*   Updated: 2019/10/18 18:44:42 by kcharlet         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

int     main()
{
    int i;
    int b;
    int *ptr;

    i = 10;
    ptr = &i;
    b = *ptr;
    ft_putnbr(b); // переменной b присвоили значение переменной, хранящейся по адресу, на который ссылается указатель
    ft_putchar('\n'); 
    ft_putnbr(*ptr); // просим функцию напечатать значение той переменной, на которую ссылается указатель
    return (0);
}

// в результате программа напечатает два раза 10