/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ppointer.c                                         :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: kcharlet <marvin@42.fr>                    +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2019/10/17 14:34:15 by kcharlet          #+#    #+#             */
/*   Updated: 2019/10/17 14:34:18 by kcharlet         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

int     main()
{
    int i;
    int j;
    int *ptr;

    i = 8;
    ptr = &i; // присвоили переменной-указателю адрес переменной i, т.е. в переменной-указателе ptr теперь хранится адрес переменной i, значение которой равно 9.
    j = *ptr; // с помощью оператора * присвоили переменной j значение, которое хранится по адресу переменнойуказателя ptr.
    ft_putnbr(j);
    return (0);
}
