/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   struct.c                                           :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: kcharlet <marvin@42.fr>                    +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2019/10/15 19:35:53 by kcharlet          #+#    #+#             */
/*   Updated: 2019/10/23 14:03:52 by kcharlet         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

int main(void)
{
	struct {
	int a;
	int b;
} x, y;

x.a = 10;

y = x;  /* присваение одной структуры другой */

ft_putnbr(x.a);
ft_putchar('\n');
return 0;
}


